# -*- coding: utf-8 -*-
"""
Created on Fri Aug 11 10:27:28 2017

@author: 17549
"""

from pyecharts import WordCloud
name=['吻下来 豁出去 这吻别似覆水','一段简约，可以维持一生',
      '这世界有什么糖苦吗？有啊！她的喜糖','当你发现时间是贼了','你低估了我和你同甘共苦的决心',
      '听出付费的感觉¬_¬','我未来的男朋友我已经瘦到90斤了','我只想知道为什么给我推荐这首歌。。。',
      '四季好与坏你都不在场','一个人吃饭旅行到处走走停停','小时候以为唐僧躲过了一劫，长大了才知玄奘错过了一生',
      '香港有句话“你靓，你能靓过Leslie”','有时候可以循环，有时候一遍都听不下去',
      '那时还年少，不觉得妹子多重要；现在长大了，单身狗汪汪汪，汪汪汪，喵。。。',
      '与年少唯一没变的我依然是个感情的怂货','为什么辅助拿蒙多','从未想过一首男人唱的民谣能炸出老夫的少女心>"<',
      '你们别吵，我要发芽','后来我才意识到，我喜欢的不是你的眼睛，而是你凝视着我时的目光',
      '这是要对一个人多绝望，才会说it aint me','和我家狗冷战带上耳机听日推突然不想冷战了突然转身对它说：我们完晚上吃狗肉',
      '听了这首歌的第二天我就被甩了',
      ]
value=[10000,9283,8106,7320,6739,5432,4111,3000,2190,1233,820,755,550,462,396,366,360,282,273,265,243,100]
wordcloud=WordCloud(width=1300,height=800)
wordcloud.add("",name,value,word_size_range=[10,55],shape='star')
wordcloud.show_config()
wordcloud.render(r"E:\17_云词图14.html")